Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [7]:
import pandas as pd

l1 = [ 4, 8, 15, 16, 23,42]
df1 = pd.Series(l1)
print(df1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
l2 = ['Ram', 4, 'sam', 6,6,7,8,9]

In [11]:
df2 = pd.Series(l2)
print(df2)

0    Ram
1      4
2    sam
3      6
4      6
5      7
6      8
7      9
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [14]:
df3 = pd.DataFrame({'Name': ['Alice', 'bob', 'claire'],
                    'age':[25,30,27], 'Gender':['Female','Male', 'Female']})

In [16]:
df3

     Name  age  Gender
0   Alice   25  Female
1     bob   30    Male
2  claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a two-dimensional data structure in which records are in the form of rows and columns.

Series are 1 dimentional data structure.

In [20]:
df2 = pd.Series(l2)
type(df2)

pandas.core.series.Series

In [21]:
df3 = pd.DataFrame({'Name': ['Alice', 'bob', 'claire'],
                    'age':[25,30,27], 'Gender':['Female','Male', 'Female']})

In [22]:
type(df3)

pandas.core.frame.DataFrame

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [26]:
##some common used columns are:
df3.columns

Index(['Name', 'age', 'Gender'], dtype='object')

In [27]:
df3.head()

     Name  age  Gender
0   Alice   25  Female
1     bob   30    Male
2  claire   27  Female

In [28]:
df3.tail()

     Name  age  Gender
0   Alice   25  Female
1     bob   30    Male
2  claire   27  Female

In [30]:
df3.dtypes

Name      object
age        int64
Gender    object
dtype: object

In [31]:
df3.describe()

             age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
df4 = pd.Series([1,2,3,4,5])
df5 = pd.Series([6,7,8,9,10])
df6 = pd.Series([11,12,13,14,15])

In [46]:
df = pd.DataFrame(pd.concat([df4,df5,df6],axis = 1))

In [51]:
type(df)

pandas.core.frame.DataFrame